tutorials/multiform/equilibriumEulerianFoam/pitzDaily-clogging/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Dc              Dc [0 2 -1 0 0 0 0]  1e-10;
St              St [0 0  1 0 0 0 0]   1e-4;

rheology
{

    nu              nu [0 2 -1 0 0 0 0]    1;
    Ca              Ca [0 0  0 0 0 0 0]    0;
    Cb              Cb [0 0  0 0 0 0 0]  2.5;
    Cc              Cc [0 0  0 0 0 0 0]  0.1;
    cm              cm [0 0  0 0 0 0 0] 0.62;
}
// ************************************************************************* //
