tutorials/multiform/equilibriumEulerianFoam/pitzDaily-clogging/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;//pointCellsLeastSquares;
}

divSchemes
{
    default         Gauss linear;
    div(phi,U)      Gauss linearUpwindV grad(U);
    div((nu*dev2(grad(U).T()))) Gauss linear;
    div((phi+phislip),c) Gauss vanLeer;//upwind;//filteredLinear2 1 0; //linearUpwind grad(c);
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
