tutorials/multiform/equilibriumEulerianFoam/pitzDaily-clogging/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    c
    {
        solver          GAMG;
        smoother        DILU;
        tolerance       1e-8;
        relTol          1e-4;
    }

    cFinal
    {
        $c;
        relTol 1e-4;
    }

    p
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          1e-4;
    }

    "(U.*|sigma)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          1e-4;
    }

    pFinal
    {
        $p;
        relTol          1e-4;
    }

    "(U|sigma)Final"
    {
        $U;
        relTol          1e-4;
    }
}

PIMPLE
{   
    consistent yes;
    momentumPredictor   off;
    nOuterCorrectors    1;
    nCorrectors         10;
    nNonOrthogonalCorrectors 2;
    pRefCell            0;
    pRefValue           0;
    turbOnFinalIterOnly no;
    residualControl
    {
        ".*"           1e-5;
    }
}

relaxationFactors
{
    equations
    {
        ".*"   1;
    }
}

// ************************************************************************* //
